Revit 2027 API
LinkConversionData.GetOptions Method
 Extra information used during the creation of the Revit document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDictionary<string, string> GetOptions()
Public Function GetOptions As IDictionary(Of String, String)
public:
IDictionary<String^, String^>^ GetOptions()
member GetOptions : unit -> IDictionary<string, string>
Return Value
IDictionary<String, String>
 The extra information used during the creation of the Revit document.
See Also
Reference
LinkConversionData Class
Autodesk.Revit.DB Namespace